#include <stdio.h>
#include <stdlib.h>
#include<windows.h>
char direction;
int main()
{
	char a[12][12]={"##########",
					"##     ###",
                    "##o###   #",
                    "# s o  o #",
                    "# **# o ##",
                    "##**#   ##",
                    "##########"};
    int x=3,y=2,i;//x,y是初始坐标；
	for(i=0;i<7;i++)
		puts(a[i]);

	while(a[4][2]!='@'||a[4][3]!='@'||a[5][2]!='@'||a[5][3]!='@')
    //所有箱子推入结束
    {
		direction=getch();
		switch(direction)
        {
        //w s a d, 方向键
			case'w':if(a[x-1][y]!='#')/*给w附注释，下面类似
									  检测前面(就是所对应方向，下同)是不是墙，可以不要但运算会变大*/
						{
                            if(a[x-1][y]==' ')//空格直接走
                            {
							a[x][y]=' ';
							x--;
							a[x][y]='s';/*我一开始写成a[x--][y]='s'
										结果不对，其实应该写成--x才能正常运行*/
							}
							else if(a[x-1][y]=='o'&&a[x-2][y]!='#')//如果是箱子，并且前面不是墙
							{
							if(a[x-2][y]==' ')//箱子前是空格推得动
								{
								a[x][y]=' ';
								x--;
                                a[x][y]='s';
                                a[x-1][y]='o';
								}
                            else if(a[x-2][y]=='*')//必须有else，否则可能多运行一步。
												   //箱子前是目的地就换成@。
                               {
							   a[x][y]=' ';
							   x--;
                                a[x][y]='s';
                                a[x-1][y]='@';
								}
                            }
                            else if(a[x-1][y]=='*')//s人想进入目的地
                            	{
								a[x][y]=' ';//空格不要紧，不会洗掉原有目的地。
											//后面有代码防止目的缺失
								x--;
                            	a[x][y]='s';
								}
                            else if(a[x-1][y]=='@')//想在目的地范围内移箱子
								{
								if(a[x-2][y]=='*')
									{
									a[x][y]=' ';
									x--;
                                    a[x][y]='*';
                                    a[x-1][y]='@';
									}
                                else if(a[x-2][y]==' ')
									{
									a[x][y]=' ';
									x--;
                                    a[x][y]='*';
                                    a[x-1][y]='o';
									}
								}
                        }break;//下面方向键类似

            case's':if(a[x+1][y]!='#')
						{
                            if(a[x+1][y]==' ')
                            {
							a[x][y]=' ';
							x++;
							a[x][y]='s';
							}
							else if(a[x+1][y]=='o'&&a[x+2][y]!='#')
							{
							if(a[x+2][y]==' ')
								{
								a[x][y]=' ';
								x++;
                                a[x][y]='s';
                                a[x+1][y]='o';
								}
                            else if(a[x+2][y]=='*')
                                {
							   a[x][y]=' ';
							   x++;
                                a[x][y]='s';
                                a[x+1][y]='@';
								}
                            }
                            else if(a[x+1][y]=='*')
                            {
							a[x][y]=' ';
							x++;
                            a[x][y]='s';
							}
                            else if(a[x+1][y]=='@')
								{
								if(a[x+2][y]=='*')
									{
									a[x][y]=' ';
									x++;
                                    a[x][y]='*';
                                    a[x+1][y]='@';
									}
                                else if(a[x+2][y]==' ')
									{
									a[x][y]=' ';
									x++;
                                    a[x][y]='*';
                                    a[x+1][y]='o';
									}
								}
                        }break;
            case'a':if(a[x][y-1]!='#')
						{
                            if(a[x][y-1]==' ')
                            {
							a[x][y]=' ';
							y--;
							a[x][y]='s';
							}
							else if(a[x][y-1]=='o'&&a[x][y-2]!='#')
							{
							if(a[x][y-2]==' ')
								{
								a[x][y]=' ';
								y--;
                                a[x][y]='s';
                                a[x][y-1]='o';
								}
                            else if(a[x][y-2]=='*')
                                {
							    a[x][y]=' ';
							    y--;
                            	a[x][y]='s';
                                a[x][y-1]='@';
								}
                            }
                            else if(a[x][y-1]=='*')
                            {
							a[x][y]=' ';
							y--;
                            a[x][y]='s';
							}
                            else if(a[x][y-1]=='@')
								{
								if(a[x][y-2]=='*')
									{
									a[x][y]=' ';
									y--;
                                    a[x][y]='*';
                                    a[x][y-1]='@';
									}
                                else if(a[x][y-2]==' ')
									{
									a[x][y]=' ';
									y--;
                                    a[x][y]='*';
                                    a[x][y-1]='o';
									}
                                }
                        }break;
            case'd':if(a[x][y+1]!='#')
						{
                            if(a[x][y+1]==' ')
                            	{
								a[x][y]=' ';
								y++;
								a[x][y]='s';
								}
							else if(a[x][y+1]=='o'&&a[x][y+2]!='#')
							{
								if(a[x][y+2]==' ')
								{
								a[x][y]=' ';
								y++;
                                a[x][y]='s';
                                a[x][y+1]='o';
								}
                             	else if(a[x][y+2]=='*')
                                {
								a[x][y]=' ';
								y++;
                                a[x][y]='s';
                                a[x][y+1]='@';
								}
                            }
                            else if(a[x][y+1]=='*')
                            	{
								a[x][y]=' ';
								y++;
                           	 	a[x][y]='s';
								}
                            else if(a[x][y+1]=='@')
								{
								if(a[x][y+2]=='*')
									{
									a[x][y]=' ';
									y++;
                                    a[x][y]='*';
                                    a[x][y+1]='@';
									}
                                else if(a[x][y+2]==' ')
									{
									a[x][y]=' ';
                                    y++;
                                    a[x][y]='*';
                                    a[x][y+1]='o';
									}
                                }
                         }break;
        }
        if(a[4][2]!='s'&&a[4][2]!='@')a[4][2]='*';
        if(a[4][3]!='s'&&a[4][3]!='@')a[4][3]='*';
        if(a[5][2]!='s'&&a[5][2]!='@')a[5][2]='*';
        if(a[5][3]!='s'&&a[5][3]!='@')a[5][3]='*';
        system("cls");//清屏
        for(i=0;i<7;i++)
			puts(a[i]);//重新打印
    }
    system("cls");
    printf("you win!\n");
    Sleep(5000);
    return 0;
}
